# 2024-05-16 11장 내장함수, 람다식, 제너레이터, 모듈

"""
파이썬은 3.8에서 69개의 내장 함수가 있다. 그중에 교재에서 설명한 함수들 소개.
"""

# abs() : 숫자의 절대값을 반환

# all() : 시퀀스(리스트, 딕셔너리)를 받아, 모든 항목이 참이면 True, 아니면 false
# 0은 False로 간주한다.

# any() : 시퀀스 객체 중 하나라도 참이면 True, 아니면 False

# bin() : 정수의 이진표현, 접두사 0b로 시작

# eval() : 수식을 실행할 때 많이 사용

# sum() : 리스트의 모든 항목을 더한다.

# len() : 객체의 길이를 계산하여 반환

# list() : 리스트를 생성

# map() : 반복가능한 객체(리스트, 튜플 등)의 항목의 함수를 적용한뒤 결과 반환

# dir()

# complex()

# max(), min()

# enumerate() : 열거형 객체 반환

# filter()

# zip() : 2개의 리스트를 하나로 묶어줌
